package game.core

/**
 * Какая доска.
 */
enum class BoardKind {
    /**
     * Одноцветная доска с фигурами в центре клетки
     */
    PLAIN,

    /**
     * Двухцветная доска с чередующимися клетками.
     */
    EUROPE,

    /**
     * Одноцветная доска с линиями пересекающимися в середине клетки.
     */
    ASIA,

    /**
     * Одноцветная доска с линиями пересекающимися в середине клетки
     * и крепостями у каждого из противников.
     */
    ASIA_CASTLE,

    /**
     * Одноцветная доска с линиями пересекающимися в середине клетки,
     * крепостями у каждого из противников и рекой между противниками.
     */
    ASIA_CASTLE_RIVER
}