package game.core

/**
 * Интерфейс который должны булут реализовать все классы представляющие ходы
 * на доске настольных игр.
 *
 * @author [Romanov V.Y.](mailto:vladimir.romanov@gmail.com)
 */
interface Move {
    /**
     * Вернуть фигуру которая делает ход.
     *
     * @return фигура которая делает ход
     */
    val piece: Piece?

    /**
     * Сделать ход (расстановку или перемещение фигур на доске).
     *
     * @throws GameOver при попытке сделать ход может быть обнаружена
     * позиция когда игра должна быть завершена (пат) или противник сдается.
     */
    @Throws(GameOver::class)
    fun doMove()

    /**
     * Вернуть фигуры в состояние до сделанного ходя.
     */
    fun undoMove()
}